; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------

[LangOptions]
LANG_NAME="Chinese Simplified"
LANG_NATIVE_NAME="简体中文"
VERSION=2.1
NAME=th_sjy
CONTACT=mailto:emeimonkey@qq.com

[Global]
TIP_ADD="添加"
TIP_EDIT="编辑"
TIP_DELETE="删除"
TIP_DELETE_ALL="删除所有"
TIP_MOVE_UP="上移"
TIP_MOVE_DOWN="下移"
BTN_SAVE="保存"
BTN_CANCEL="取消"
CHK_QUOTES="用引号括起来"
LST_SEC_QUOTES="引号"
ERROR_MSG_TITLE="错误!"
WARNING_MSG_TITLE="警告"
INFORMATION_MSG_TITLE="信息"
QUESTION_MSG_TITLE="问题"
BTN_OK="确定"
TEST="测试"
TIP_BROWSE="浏览文件"
TIP_OPEN="打开文件位置"

[Menu]
MENU_FILE="文件(&F)"
MENU_SETTINGS="设置(&S)"
MENU_HELP="帮助(&H)"
MI_OPEN="打开文件(&O)"
MI_RELOAD="重新打开(&E)"
MI_SAVE="保存(&S)"
MI_SAVE_AS="另存为(&A)"
MI_CLOSE="关闭(&C)"
SUB_MENU_RECENT_FILES="最近文件(&R)"
MI_CLEAR_LIST="清除列表(&L)"
MI_EXIT="退出(&X)"
MI_OPTIONS="选项(&O)"
SUB_MENU_LANG="语言(&L)"
MI_HELP="帮助(&P)"
MI_SITE="项目站点(&S)"
MI_ABOUT="关于(&B)"
MI_PRESET_MANAGER="预设管理器"

[ToolbarTips]
OPEN="打开文件"
SAVE="保存"
SAVE_AS="另存为"
CLOSE="关闭文件"
TEST="测试"
PRESET="管理预设"
MAKE_SFX="生成自解压"
OPTIONS="程序选项"

[TabNames]
MAIN="主要"
TITLE_TEXT="标题/文本"
DIALOGS="对话框"
RUN="运行"
DELETE="删除"
SHORTCUTS="快捷方式"
SET_ENV="设置环境"
OUTPUT="输出"
SFX="自解压"

[Tab_Main]
CHK_TEMP_MODE="临时模式"
CHK_SKIP_LOCKED="跳过系统锁定文件"
CHK_DELETE_SFX="解压后删除自解压文件"
CHK_BPT="开始提示超时:"
CHK_XDWIDTH="解压对话框宽度:"
CHK_XPWIDTH="解压路径宽度:"
CHK_VOLNAME="卷名称样式:"
RAD_OW_MODE_1="覆盖所有文件"
RAD_OW_MODE_2="不要覆盖文件"
RAD_OW_MODE_3="覆盖旧文件"
RAD_GUI_MODE_1="显示所有GUI"
RAD_GUI_MODE_2="解压时禁用取消"
RAD_GUI_MODE_3="隐藏所有GUI窗口"
GRP_OW_MODE="覆盖模式:"
GRP_GUI_MODE="GUI模式:"
LBL_EXT_PATH="解压路径:"
MI_SFX_NAME="自解压名称"
MI_SFX_PATH="自解压路径"
TIP_EDIT="点击编辑"
TIP_INSERT="点击插入变量"
TIP_RELOAD="重新加载"
TIP_OPEN="用默认文本编辑器打开"

[Tab_TitleText]
GRP_TITLE="标题"
GRP_TEXT="文本"
LBL_WIN_TITLE="窗口标题:"
LBL_EXT_PATH_WIN_TITLE="解压路径窗口标题:"
LBL_EXT_WIN_TITLE="解压标题:"
LBL_ERROR_WIN_TITLE="错误消息标题:"
LBL_WARN_WIN_TITLE="警告消息标题:"
LBL_PASSWD_TITLE="密码标题:"
LBL_PASSWD_TEXT="密码文本:"
LBL_EXT_CANCEL_TEXT="解压取消文本:"

[Tab_RunProgram]
LST_SEC_PARAMETER="参数"
LST_SEC_PREFIX="前缀"
LST_SEC_FILE_FOLDER="文件路径"
LST_SEC_COMMANDS="命令"

[Tab_Delete]
LST_SEC_PARAMETER="参数"
LST_SEC_FILE_FOLDER="文件/文件夹路径"

[Tab_Shortcuts]
LST_SEC_PARAMETER="参数"
LST_SEC_PATH="路径"
LST_SEC_SRC="源"
LST_SEC_CMDS="命令"
LST_SEC_NAME="名称"
LST_SEC_DESC="描述"
LST_SEC_DEST="目标"
LST_SEC_WD="工作目录"
LST_SEC_ICON="图标"
LST_SEC_INDEX="索引"

[Tab_SetEnvironment]
LST_SEC_NAME="变量名称"
LST_SEC_VALUE="值"

[Tab_SFX]
BTN_SELECT="选择"
BTN_MAKE_SFX="生成自解压"
BTN_SFX_OPTIONS="自解压选项"
BTN_EDIT_VERS="编辑版本信息"
CHK_INCLUDE_PATH="配置文件中包含路径"
CHK_USE_SELECTED_CFG="使用选择的配置文件"
GRP_SFX_FILES="自解压文件"
GRP_SFX_ICON="图标"
LBL_CONFIG_FILE="配置文件:"
LBL_7Z_ARCHIVE="7z压缩:"
LBL_SFX_MODULE="自解压模块:"
LBL_SFX_PATH="自解压路径:"
LBL_SFX_ICON="自解压图标:"

[GUI_ProgramOptions]
GUI_TITLE="程序选项"
BTN_INTEGRATE="在上下文菜单中集成程序"
BTN_EXPORT="导出"
MI_REGISTRY="注册表文件"
MI_INI="INI文件"
CHK_USERMODE="在注册表中保存设置"
CHK_AUTODEFMOD="自动使用默认模块 (如果加载的配置不包含它)"
CHK_IGNORE_EMPTY="不要创建空版本信息键"
CHK_AUTO_NAME_SFX="在压缩文件目录中创建自解压文件 (如果不定义自解压路径)"
CHK_OVERWRITE_FILES="覆盖现有自解压文件"
GRP_PROGRAM="程序"
GRP_SFX="自解压"
LBL_LANGUAGE="界面语言:"

[GUI_PresetManager]
GUI_TITLE="预设管理器"
GUI_TITLE2="新建预设"
GUI_TITLE3="重命名预设"
BTN_NEW="新建"
BTN_LOAD="加载"
BTN_SAVE="保存"
BTN_EDIT="编辑名称"
BTN_DELETE="删除"
LBL_NAME="键入预设名称:"

[GUI_ArchiveSets]
CHK_SUBFILES="仅在给定的文件夹中压缩文件/文件夹"
LBL_DRAGDROP="您可以使用拖放功能来添加文件/文件夹"
TIP_ADDFILE="添加文件"
TIP_ADDFOLDER="添加文件夹"

[GUI_SFXOpts]
GUI_TITLE="自解压选项"
TAB_SFX_OPTIONS="自解压选项"
TAB_ARCHIVE_FILES="压缩文件"
CHK_USE_UPX="用UPX压缩自解压模块"
CHK_USE_SFX_MOD="使用下面的自解压模块:"
CMB_USE_7ZIP1="总是使用7-Zip"
CMB_USE_7ZIP2="仅当指定压缩文件时使用7-zip"
CMB_USE_7ZIP3="不使用7-Zip (如果指定7z压缩)"
CMB_USE_7ZIP4="从不使用7-Zip"
LBL_PATH="7-Zip路径"
TIP_BROWSE="选择7-Zip路径"
TIP_CONFIG="7-Zip配置"
7ZIP_TITLE="7-Zip配置"
7ZIP_LEVEL="压缩级别:"
7ZIP_METHOD="压缩方法:"
7ZIP_DICT="字典大小:"
7ZIP_SOLID="固实块大小:"

[GUI_VersionInfo]
GUI_TITLE="编辑文件版本信息"
BTN_LOAD="加载"
MI_LOAD_SFXMOD="从选择的自解压模块"
MI_LOAD_FILE="从文件"
MI_LOAD_VALUES="加载保存"
MI_SAVE_VALUES="保存当前值"
CHK_INCLUDE="配置文件中包括信息"
CHK_CHANGE_VERS="更改版本信息"

[GUI_Gui.MiscFlags]
GUI_TITLE="编辑GUI/杂项标志"
BTN_NEW="新建"
BTN_LOAD="加载"
BTN_RESET="重置"
BTN_DELETE="删除"
LBL_GUI_FLAG_1="在标题栏右侧显示解压百分比 (默认在左侧)"
LBL_GUI_FLAG_2="不在标题栏中显示解压百分比"
LBL_GUI_FLAG_4="根据进度栏显示"
LBL_GUI_FLAG_8="使用Windows XP样式 (方案)"
LBL_GUI_FLAG_16="解压百分比使用加粗字体"
LBL_GUI_FLAG_32="在解压进度栏窗口中显示图标"
LBL_GUI_FLAG_64="使用窗口 "开始提示" 指定解压路径"
LBL_GUI_FLAG_128="使用单独窗口指定解压路径"
LBL_GUI_FLAG_256="确认取消安装/解压"
LBL_GUI_FLAG_512="不在标题栏所有窗口和[Alt+Tab]显示图标"
LBL_GUI_FLAG_1024="在指定解压路径窗口中显示图标"
LBL_GUI_FLAG_2048="在 "开始提示" 窗口中显示图标"
LBL_GUI_FLAG_4096="更改图标和按钮名称. 用 "确定/取消" , 代替 "是/否" ."
LBL_GUI_FLAG_8192="不在Windows7或更高版本的任务栏上显示进度栏"
LBL_GUI_FLAG_16384="在文本中显示 "&&" 符号"
LBL_MISC_FLAG_1="不验证解压所需可用磁盘空间"
LBL_MISC_FLAG_2="不验证解压所需可用内存"
LBL_MISC_FLAG_4="所有操作需要管理员权限"
LBL_MISC_FLAG_8=" "开始提示" 和 "解压路径" 窗口后显示密码请求窗口"

[GUI_RunProgram]
GUI_TITLE="添加解压后运行的程序"
GUI_PFX_TITLE="编辑前缀"
LBL_PARAMETER="参数:"
LBL_FILE="文件:"
LBL_PREFIX="前缀:"
LBL_COMMANDS="命令:"

[GUI_Delete]
GUI_TITLE="添加解压后删除的文件"
LBL_PARAMETER="参数:"
LBL_FILE="文件/文件夹:"

[GUI_Shortcuts]
GUI_TITLE="添加创建快捷方式"
RAD_DESKTOP="桌面"
RAD_START_MENU="开始菜单"
RAD_PROGRAMS="开始菜单\程序"
RAD_STARTUP="启动"
RAD_CURRENT_USER="当前用户"
RAD_ALLUSERS="所有用户"
GRP_CREATION_PATH="创建位置"
GRP_CREATE_FOR="创建为"
GRP_PARAMETER="参数:"
LBL_SOURCE_FILE="源文件:"
LBL_ARGUMENTS="参数:"
LBL_NAME="快捷方式名称:"
LBL_DESCRIPTION="快捷方式描述:"
LBL_DEST_FOLDER="目标文件夹:"
LBL_WORKING_DIR="工作目录:"
LBL_ICON_FILE="图标文件:"
LBL_ICON_INDEX="图标索引:"

[GUI_SetEnvironment]
GUI_TITLE="创建环境变量"
LBL_NAME="名称:"
LBL_VALUE="值:"

[GUI_MakeSFX]
GUI_TITLE="创建自解压"
BTN_OPEN="浏览"
BTN_RUN="运行自解压"
BTN_CLOSE="关闭"
REPORT_PREP="正在准备..."
REPORT_ARCHIVE1="正在创建压缩..."
REPORT_ARCHIVE2="7-Zip不存在!"
REPORT_ARCHIVE3="文件不存在: \~s"
REPORT_ARCHIVE4="成功创建压缩"
REPORT_ARCHIVE5="无法创建压缩!"
REPORT_ERROR1="找不到配置文件: \~s"
REPORT_ERROR2="下面的文件不是7Z自解压配置文件: \~s"
REPORT_ERROR3="创建自解压错误!"
REPORT_ICON1="更改自解压图标..."
REPORT_ICON2="自解压图标更改成功"
REPORT_ICON3="无法更改自解压图标!"
REPORT_VERSINFO1="正在更新版本信息..."
REPORT_VERSINFO2="版本信息更新成功"
REPORT_VERSINFO3="无法更新版本信息!"
REPORT_UPX1="正在用UPX压缩..."
REPORT_UPX2="压缩成功完成"
REPORT_UPX3="找不到"upx.exe"!"
REPORT_BUILD1="创建自解压..."
REPORT_BUILD2="创建自解压错误!"
REPORT_FINISH="自解压创建成功: \~s"

[MessageBoxes]
; File open/save operations
MSGBOX1_1="无法找到语言文件!"
MSGBOX1_2="指定的文件不存在!"
MSGBOX1_3="文件未加载或不存在!"
MSGBOX1_4="指定的配置文件不存在!"
MSGBOX1_5="你想打开文件: \~n\~s - ?"
MSGBOX1_6="\~s\n不是7z自解压配置文件!\~n你想加载它吗?"
MSGBOX1_7="文件大于正常配置文件大小!\n你想加载它吗?"
MSGBOX1_8="缺少当前操作所需的文件:\n\s"
MSGBOX1_9="此文件不包含配置文件! 无法继续!"
MSGBOX1_10="你确定要重新加载文件?"
MSGBOX1_11="不能保存当前配置. 你想现在保存吗?"
MSGBOX1_12="无法读取或写入文件! 请确保您有管理员权限."
; SFX creation
MSGBOX2_1="指定的自解压文件路径不存在!"
MSGBOX2_2="自解压模块未指定!"
MSGBOX2_3="指定的自解压模块不存在或不是所需的格式!"
MSGBOX2_4="不是指定的压缩文件!"
MSGBOX2_5="不是指定的压缩文件!"
MSGBOX2_6="指定的压缩文件不存在或不是所需的格式!"
MSGBOX2_7="你想覆盖现有文件: \~n\~s - ?"
MSGBOX2_8="7-Zip不存在!"
MSGBOX2_9="你想使用以下压缩文件: \~n\~s - ?\~n如果你想从配置文件中定义的文件创建新的压缩文件, 请点击 "否"."
; Other operations
MSGBOX3_1="程序成功地集成在上下文菜单中."
MSGBOX3_2="按 "确定" 关闭测试窗口"
MSGBOX3_3="你想覆盖现有的值吗?"
MSGBOX3_4="请至少选择一个项目."
MSGBOX3_5="请只选择一个项目."
MSGBOX3_6="你确定要删除选择的项目?"
MSGBOX3_7="你确定要删除所有项目?"
MSGBOX3_8="指定的数据是无效的或为空!"
MSGBOX3_9="不是指定的文件!"
